# Description Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisWindowType..::..Description Property
EnergyAnalysisWindowType Class See Also
---
The description of the window type.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace